#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_jsb-csrs-991.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4316d65f-3ec3-4a9b-9b25-67edbfa7b4cc]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6317c2ef-91bd-46a1-963a-0a7afdeaf7c9]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9233062d-7b5d-4bc8-847d-99dcd6d7dac6]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d8f3385d-373d-4eee-917b-7967f725ec79]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2dc6e22c-402c-4789-a572-9a26cc2a693a]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9619c43b-261e-41db-b6ac-15c7047f86de]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc148327-319c-475c-a943-8a313bc7f828]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5f0ac9d-5d82-4162-9291-7b504da9f90b]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2fa4c6a4-df79-4d65-990b-6ad664f88e84]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0c4cf74f-bd9d-4132-9aad-61386c6a6276]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=663a2b35-5a2c-4b4a-81d0-1ffb5aa5552b]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=486ef5af-3d16-43c7-ab49-b4b0885b0301]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2100d5aa-8e64-4b52-8b4d-251dba738486]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ea441563-7b17-47d5-8a0e-218d6d4059b3]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bdb42f92-b7b5-411b-abad-5f80bd54aaef]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7139598a-025c-48fc-9827-6e3e646be861]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e3004fa1-2525-4633-ae61-854d40d59657]
module.keycloak_dev.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=97e5c51d-af9e-475b-84a4-f453e34a9957]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=610ae2d1-a061-424f-bf4c-7990f15f4bab]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=65dbe9f0-c006-446e-b6ba-3d2d0a14a170]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=37159c4b-7424-42f5-9cbb-923411b613f5]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f801ff5b-4554-4b6b-8a8d-913ac5f6825b]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce678b37-c428-4c77-a654-bd1167449b44]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8efbd1e0-39e1-46e5-a276-b34561dfa6df]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b03c5264-43a8-4f96-af31-de27606e3312]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c89902ef-e229-43c1-89d2-06cfb1c710d8]
module.keycloak_dev.module.onestopauth.module.client_css-e-forms-poc-1585.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=02632da9-22d3-435c-a6ab-9774cc2d13e6]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9ba9c286-6723-4e59-95b0-07005b6378f1]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7ae4b92b-7821-4914-8e71-ff2ce15bec26]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f30db6b7-1251-4646-98cd-5c083e48b338]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bb2304f6-f7cf-4265-a421-8413dbd6f542]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f35d6034-50c7-439d-9bf3-697805ad6c8f]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9197a2a5-c290-4a2e-8507-d24f0d048ebe]
module.keycloak_dev.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8856ad9b-6674-4415-8720-fefb81dd9c2e]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c74e0d2a-bd3e-46ec-9b04-0249629c5110]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8eaf3833-1600-4c88-add9-733a8db25320]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73347af8-9d7f-41c6-b41b-57a19bcdd922]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6ff0f6c6-b864-4f37-b56f-2db93b4f89f3]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9c47eb8e-e8cc-4fe5-ad64-cf9a9f4eb7ad]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfc7b2f4-69dd-4b01-a3cc-bb82a0b1ef3f]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a872eecf-9d54-4c1a-9700-d3773bc68c47]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab08314c-ea04-4c22-821d-9040eb74269a]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b6e76c9-9083-4d86-9ceb-9580c2eda649]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=63427cdd-76ac-4c26-b075-780d1386f05a]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4c929283-3ab7-4e43-a7e5-65de6046bf18]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=549ab458-6d0b-4109-8d8e-07a32ffd06f2]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e08eb222-d232-44d1-8a3b-02162764b0b7]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=db6a1331-bb77-4352-a4db-e70aacbd2dee]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=99202aa7-1878-4183-aa07-d83bed9002ed]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f277c433-dfd2-4e20-a66e-ccfda7059b4c]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbb8d93f-8bf6-47ba-9280-f2902412d568]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5a2c1ec6-1b74-4ff9-9dc8-146091e16d41]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e2ffc5a-d75c-4af8-ad2f-0e615a9b6cc9]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0268a0bd-210c-4cab-87db-4b4515b740dd]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e71af3b2-7fff-46ec-b395-654d515095b7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63937871-a3e2-418d-aee6-947ccafeabe2]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ff00512-dc13-4356-8e0f-8fee2715ce0e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b04206d6-d37b-44c9-b76e-2cbddec96ded]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c32ad305-13ab-44bd-83c6-f1d1cb5f4525]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ea5c127b-e074-454e-851a-02420ee8bd8b]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1a312e7e-96c2-41d1-9dd4-dff6b0f4e81f]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=26176a12-6339-4490-a705-b7e17253a1ff]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2943082f-38ae-4030-a66c-61a8ade9de51]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22dccf37-6825-49ee-ba44-571c01a6bd39]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de9c0fba-8bfb-4aee-a657-421c2984a085]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=161d9e07-d68b-4947-a51c-d692c84846b1]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=ee54c1c6-23c8-4be7-9463-25881f78dd53]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_openid_client.this: Refreshing state... [id=e79b044e-484c-4f00-80eb-167b41f86c5e]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_openid_client.this: Refreshing state... [id=5d3e395d-3c91-4634-8233-6727de9b3308]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=791fb085-4077-4292-8bd6-089822864060]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7ce6f0e-e17e-4773-b298-cdab9e403260]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de6759e3-f34a-44f2-80bf-70f389217fee]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8ed88e91-2fa6-4caa-9866-1b7e841c1d2d]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b9a9c25c-7581-4814-9386-50f8a95d78e4]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f52e6d5-7573-424a-badb-919f8b37b1a1]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=013df6be-f41a-4cd5-b20a-c4bd294472a0]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=138b27cc-20ca-4387-b3c8-e3678d6b7578]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7a3a2d15-6cd7-44a2-a64b-ce27dc1da650]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=24194681-e44b-4bb4-890e-f52025105f67]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6486ccdb-4981-4c76-9829-51888ac63f6a]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d7e50097-5bff-4e3e-b239-f1145d6e5753]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccee6b0d-a27d-45c7-afad-c4dfd345e614]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47288847-b2d5-4398-8491-7e80aa875e90]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e689aa1-a2ce-4c30-b366-7e79238036a3]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b955a72-4cb1-4e12-b22b-d4e669dd18b9]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=77ecb837-262f-4c95-928a-02747857d333]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa5ba504-05e2-4b35-bbdc-f42a96826811]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b39ea164-2a54-487a-9e70-e24bb8725b05]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8c1ef37a-f490-4930-9872-bdc679b86d41]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3da90b88-8373-4935-821f-105dd858915c]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4158cca-c5a0-4a5c-9339-1fa87acfdd5c]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=61ba36cc-85c4-4a29-9ec6-24d8f084a2ef]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=328730fd-9df2-406d-b43d-0e5b450c6ed0]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3652228-cde4-4b18-94c8-7ad95dd2c75e]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=03d53390-0147-47ad-875a-a9f0927b9bfc]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8fae1957-fc42-4d0a-a16d-f80967e5be74]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa46fbc7-df18-4d40-bac8-f90276d596f9]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a60d017-1041-45de-857a-a86f27c37dea]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "invasives-bc-1849"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "invasives-bc-1849"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "invasives-bc-1849"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "invasives-bc-1849"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
          + "https://dev-invasivesbci.apps.silver.devops.gov.bc.ca",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "invasives-bc-1849"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "invasives-bc-1849"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "invasives-bc-1849"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "invasives-bc-1849"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://test-invasivesbci.apps.silver.devops.gov.bc.ca",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 563 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*